УТ/src/Catalogs/CRM_УчетныеЗаписиМессенджеров/CRM_УчетныеЗаписиМессенджеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_УчетныеЗаписиМессенджеров</name>
  <predefined>
    <items>
      <name>B2BПортал</name>
      <description>B2B портал</description>
    </items>
    <items>
      <name>СистемаВзаимодействия</name>
      <description>Система взаимодействия</description>
    </items>
  </predefined>
  <attributes>
    <name>CRM_ВариантАвтосозданияКлиентов</name>
    <comment>АПК:1032 АПК:265 не проверять на орфографию синоним и имя</comment>
    <type>
      <types>EnumRef.CRM_ВариантыАвтосозданияКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ИсточникЛидов</name>
    <comment>АПК:265 не проверять на орфографию имя</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОбрабатыватьОбращения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ПартнерГруппа</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ПартнерСтатусРаботы</name>
    <type>
      <types>CatalogRef.CRM_СтатусыРаботыСКлиентом</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_РольОтветственного</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СоздаватьПартнера</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СрокЖизниОбращения</name>
    <comment>Время жизни обращения (дней)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СрокОбработкиДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СрокОбработкиМинут</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СрокОбработкиЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_УказыватьПричинуОтклонения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Включена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьWebhook</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МетодWebhook</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроксиПароль</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроксиПользователь</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроксиПорт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроксиСервер</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьПросмотрСообщенийВсемПользователям</name>
    <comment>Разрешить просмотр сообщений всем пользователям, независимо от настройки доступа</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипМессенджера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйИдентификаторЗадания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УсловияИспользованияПриняты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеПараметровДоступа</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>CRM_ПравилаОбработки</name>
    <attributes>
      <name>УсловиеОбработки</name>
      <type>
        <types>CatalogRef.CRM_УсловияОбработкиОбращений</types>
      </type>
    </attributes>
    <attributes>
      <name>ПравилоОбработки</name>
      <type>
        <types>CatalogRef.CRM_ПравилаОбработкиОбращений</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_Сценарии</name>
    <attributes>
      <name>Сценарий</name>
      <type>
        <types>CatalogRef.CRM_СостоянияИнтересов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ/src/CommonModules/CRM_РаботаСМессенджерамиКлиент/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// CRM работа с мессенджерами сервер
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Подключает обработчик служебных сообщений.
//
// Параметры:
//	ИдентификаторыОбсуждений - Массив - Идентификаторы обсуждений.
//
Процедура ПодключитьОбработчикСлужебныхСообщений(ИдентификаторыОбсуждений) Экспорт
	
	Для каждого Идентификатор Из ИдентификаторыОбсуждений Цикл
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработчикНовогоСлужебногоСообщенияМессенджера",
			 CRM_РаботаСМессенджерамиКлиент);
		СистемаВзаимодействия.НачатьПодключениеОбработчикаНовыхСообщений(, Идентификатор, ОписаниеОповещения);
	КонецЦикла;
	
КонецПроцедуры

// Подключает обработчик новых сообщений.
//
// Параметры:
//	ИдентификаторыОбсуждений - Массив - Идентификаторы обсуждений.
//
Процедура ПодключитьОбработчикНовыхСообщений(ИдентификаторыОбсуждений) Экспорт
	
	Для каждого Идентификатор Из ИдентификаторыОбсуждений Цикл
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработчикНовогоСообщенияМессенджера", CRM_РаботаСМессенджерамиКлиент);
		СистемаВзаимодействия.НачатьПодключениеОбработчикаНовыхСообщений(, Идентификатор, ОписаниеОповещения);
	КонецЦикла;
	
КонецПроцедуры

// Обработчик нового служебного сообщения мессенджера.
//
// Параметры:
//	Сообщение - ДокументСсылка.CRM_СообщениеМессенджера - Сообщение.
//	ДополнительныеПараметры - Структура - Дополнительные параметры.
//
Процедура ОбработчикНовогоСлужебногоСообщенияМессенджера(Сообщение, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Сообщение.Данные) <> Тип("Строка") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Сообщение.Данные) Тогда
		Возврат;
	КонецЕсли;
	
	ПользовательСистемыВзаимодействия = СистемаВзаимодействия.ИдентификаторТекущегоПользователя();
	Если ПользовательСистемыВзаимодействия = "" Тогда
		Возврат;
	КонецЕсли;
	
	Если Сообщение.Данные = "CRM_ПолученыНовыеСообщения" Тогда
		Если глОткрытаФормаДиалогов = Истина Тогда
			Оповестить(Сообщение.Данные);
		Иначе
			ТекущийПользователь = ПользователиКлиент.ТекущийПользователь();
			НовыхСообщений = CRM_РаботаСМессенджерамиСервер.ПроверкаНепрочитанныхСообщений(ТекущийПользователь,
				 ТекущийПользователь,
				 Неопределено);
			ВывестиОповещениеОНепрочитанныхНаРабочийСтол(НовыхСообщений);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Обработчик нового сообщения мессенджера.
//
// Параметры:
//	Сообщение - ДокументСсылка.CRM_СообщениеМессенджера - Сообщение.
//	ДополнительныеПараметры - Структура - Дополнительные параметры.
//
Процедура ОбработчикНовогоСообщенияМессенджера(Сообщение, ДополнительныеПараметры) Экспорт
	
	ПользовательСистемыВзаимодействия = СистемаВзаимодействия.ИдентификаторТекущегоПользователя();
	Если ПользовательСистемыВзаимодействия = "" Тогда
		Возврат;
	КонецЕсли;
	CRM_РаботаСМессенджерамиСервер.ПолучитьСообщенияУчетнойЗаписиВФоне(ПредопределенноеЗначение("Справочник.CRM_УчетныеЗаписиМессенджеров.СистемаВзаимодействия"));
	
КонецПроцедуры

// Функция возвращает признак использования условий использования файлов.
//
// Параметры:
//	ТипМессенджера - Строка - тип мессенджера.
//
// Возвращаемое значение:
//  Булево - Истина, если требуется принимать условия использования для передавчи файлов.
//
Функция ДляМессенджераЕстьУсловияИспользованияФайлов(ТипМессенджера) Экспорт
	
	СписокМессенджеров = Новый СписокЗначений;
	СписокМессенджеров.Добавить("InstagramDirect");

	Возврат СписокМессенджеров.НайтиПоЗначению(ТипМессенджера) <> Неопределено;

КонецФункции // ДляМессенджераЕстьУсловияИспользованияФайлов()

// Подключение обработчиков сообщений системы взаимодействий.
//
// Параметры:
//  ИзМессенджера	 - Булево	 - Признак подключения обработчиков из мессенджера.
//
Процедура ПодключитьОповещенияОСлужебныхСообщениях(ИзМессенджера = Ложь) Экспорт
	
	ПараметрыОповещений = CRM_РаботаСМессенджерамиСервер.ПараметрыОповещенйОНовыхСообщениях();
	
	Если Не ПараметрыОповещений.ИспользуютсяМессенджеры Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрыОповещений.ОбсужденияДоступны
		И (ИзМессенджера
			Или ПараметрыОповещений.ОповещенияНаРабочемСтоле) Тогда
		ПодключитьОбработчикСлужебныхСообщений(ПараметрыОповещений.ИдентификаторыОбсужденийСлужебные);
	КонецЕсли;
	Если Не ИзМессенджера Тогда
		ТекущийПользователь = ПользователиКлиент.ТекущийПользователь();
		НовыхСообщений = CRM_РаботаСМессенджерамиСервер.ПроверкаНепрочитанныхСообщений(ТекущийПользователь,
			 ТекущийПользователь,
			 Неопределено);
		ВывестиОповещениеОНепрочитанныхНаРабочийСтол(НовыхСообщений);
	КонецЕсли;
	
КонецПроцедуры

// См. ИнтеграцияПодсистемБСПКлиент.ПередПериодическойОтправкойДанныхКлиентаНаСервер
Процедура ПередПериодическойОтправкойДанныхКлиентаНаСервер(Параметры) Экспорт
	
	Если глИспользуютсяДиалогиНаРабочемСтоле = Истина
		И Не глОткрытаФормаДиалогов = Истина 
		И ск_глСтекФормРабочегоСтола <> Неопределено
		И ск_глСтекФормРабочегоСтола.Количество() > 0 Тогда 
		
		ИмяПараметра = "CRM_Мессенджеры.ОповещениеОНовыхСообщениях";
		Если Не СерверныеОповещенияКлиент.ЗакончилосьВремяОжидания(ИмяПараметра, 60) Тогда
			Возврат;
		КонецЕсли;
	
		Параметры.Вставить(ИмяПараметра, Истина);
	КонецЕсли;
	
КонецПроцедуры

// См. ОбщегоНазначенияКлиентПереопределяемый.ПослеПериодическогоПолученияДанныхКлиентаНаСервере
Процедура ПослеПериодическогоПолученияДанныхКлиентаНаСервере(Результаты) Экспорт
	
	ИмяПараметра = "CRM_Мессенджеры.ОповещениеОНовыхСообщениях";
	Данные = Результаты.Получить(ИмяПараметра);
	Если Данные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ВывестиОповещениеОНепрочитанныхНаРабочийСтол(Данные);
	
КонецПроцедуры

// Процедура для вывода оповещений о непрочитанных письмах на рабочий стол.
//
// Параметры:
//  Данные	 - Структура	 - Данные оповещения.
//
Процедура ВывестиОповещениеОНепрочитанныхНаРабочийСтол(Данные) Экспорт
	
	Если ск_глСтекФормРабочегоСтола = Неопределено
		Или Не Данные.Свойство("Все") Тогда
		Возврат;
	Иначе
		СтрДиалоги = НСтр("ru = 'Диалоги'");
		глЗаголовокДиалогов = СтрДиалоги + Формат(Данные.Все, "ЧФ=' (Ч)'");
	КонецЕсли;
	Для Каждого ПолученнаяФорма Из ск_глСтекФормРабочегоСтола Цикл
		Группа = ПолученнаяФорма.Значение.Элементы.Найти("ЭлементГруппаКнопокТумблер");
		Для Каждого Элемент Из Группа.ПодчиненныеЭлементы Цикл
			Если СтрНачинаетсяС(Элемент.Заголовок, СтрДиалоги)
				И Элемент.Заголовок <> глЗаголовокДиалогов Тогда
				Элемент.Заголовок = глЗаголовокДиалогов; 
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
